spec/cassets/Create_payment_on_successful_charge/creates_a_payment_with_the_webhook_from_stripe_for_charge_succeeded.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_16BzODBJ06TFLyLgQ0n4Povh
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_ul22oh1t65Ts0Ygsq7au2E4A
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.13.0-37-generic (buildd@kapok) (gcc version 4.8.2 (Ubuntu 4.8.2-19ubuntu1)
        ) #64-Ubuntu SMP Mon Sep 22 21:28:38 UTC 2014","hostname":"kelvin-MS-7693"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 10 Jun 2015 06:21:16 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1960'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_l94LNiXwBFhdJoOm
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_16BzODBJ06TFLyLgQ0n4Povh",
          "created": 1433904989,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_16BzODBJ06TFLyLgS4LgIqB5",
              "object": "charge",
              "created": 1433904989,
              "livemode": false,
              "paid": true,
              "status": "succeeded",
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_16BzOCBJ06TFLyLgJqxNn9T8",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 6,
                "exp_year": 2015,
                "fingerprint": "3zadDNu4t8ZEhLHh",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6OmyfHTfidE7lu"
              },
              "captured": true,
              "balance_transaction": "txn_16BzODBJ06TFLyLgkEeMzCEh",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_6OmyfHTfidE7lu",
              "invoice": "in_16BzOCBJ06TFLyLgDfOfxeRa",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": "myflix monthly charge",
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "destination": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_16BzODBJ06TFLyLgS4LgIqB5/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_6OmyBKyTngx7Bn",
          "api_version": "2015-04-07"
        }
    http_version: 
  recorded_at: Wed, 10 Jun 2015 06:21:17 GMT
recorded_with: VCR 2.9.3
